{
  "format": "layers-model",
  "generatedBy": "tf_keras 2.21.0",
  "convertedBy": "manual (tfjs-compat)",
  "modelTopology": {
    "keras_version": "2.21.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "weight_reps_predictor_lstm",
        "layers": [
          {
            "module": "keras.layers",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                8,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "lstm_input",
              "optional": false
            },
            "registered_name": null
          },
          {
            "module": "keras.layers",
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "dtype": "float32",
              "batch_input_shape": [
                null,
                8,
                3
              ],
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 32,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            },
            "registered_name": null,
            "build_config": {
              "input_shape": [
                null,
                8,
                3
              ]
            }
          },
          {
            "module": "keras.layers",
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.15,
              "noise_shape": null,
              "seed": null
            },
            "registered_name": null,
            "build_config": {
              "input_shape": [
                null,
                32
              ]
            }
          },
          {
            "module": "keras.layers",
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 16,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
              "input_shape": [
                null,
                32
              ]
            }
          },
          {
            "module": "keras.layers",
            "class_name": "Dense",
            "config": {
              "name": "output",
              "trainable": true,
              "dtype": "float32",
              "units": 2,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
              "input_shape": [
                null,
                16
              ]
            }
          }
        ]
      },
      "keras_version": "2.21.0",
      "backend": "tensorflow"
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "lstm/lstm_cell/kernel",
          "shape": [
            3,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm/lstm_cell/recurrent_kernel",
          "shape": [
            32,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm/lstm_cell/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [
            32,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "output/kernel",
          "shape": [
            16,
            2
          ],
          "dtype": "float32"
        },
        {
          "name": "output/bias",
          "shape": [
            2
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}